Extensions/src/Documents/ЧекККМ/ЧекККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЧекККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресЭП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЭквайринговыйТерминал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерЧекаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПолученоНаличными</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>AzRyАналитикаКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>AzRyЭлектроннаяНакладная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаОплатыПлатежнымиКартами</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НоммерОчереди</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Консультант</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроцентСкидкиПоДисконтнойКарте</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Архивный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НДСВключатьВСтоимость</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидСкидкиНаценки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДисконтнаяКарта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкидкиРассчитаны</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>СкидкиНаценки</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections>
    <name>Запасы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Заказ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СерийныеНомера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПроцентАвтоматическойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Партия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Резерв</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаАвтоматическойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Всего</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Консультант</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СпособОкругления</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОплатаПлатежнымиКартами</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>СсылочныйНомер</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерЧекаЭТ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВидПлатежнойКарты</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерПлатежнойКарты</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>24</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

Extensions/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КурсыВалют</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Кратность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Extensions/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Extensions/src/Enums/СтатусыЧековККМ/СтатусыЧековККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыЧековККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Пробит</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Extensions/src/Enums/ТипыСтруктурныхЕдиниц/ТипыСтруктурныхЕдиниц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыСтруктурныхЕдиниц</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Розница</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РозницаСуммовойУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Extensions/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Запас</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Операция</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВидРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3f30b5ae-fc5b-4d76-8874-1de7438feca1">
    <name>Лицензия</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Extensions/src/Documents/ЧекККМ/Forms/ФормаДокумента_РМК/Module.bsl
&НаСервере
Процедура РасшAzRy_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	
	// Заказы покупателей в Рознице
	ИспользоватьЗаказыВРозничнойТорговле = ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыВРозничнойТорговле");
	ИспользоватьРезервированиеЗапасов = ПолучитьФункциональнуюОпцию("РезервированиеЗапасов");
	// Конец Заказы покупателей в Рознице
	
	// РМК
	КассаККМ = Параметры.ЗначенияЗаполнения.КассаККМ;
	Если НЕ ЗначениеЗаполнено(КассаККМ) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ka='მომხმარებლისთვის არ არის განსაზღვრული სსა სალარო!';ru='Для пользователя не определена Касса ККМ!';en='For the user is not defined Cash CMC!'");
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Пользователь = Пользователи.ТекущийПользователь();
	
	ПредыдущаяКассаККМ = КассаККМ;
	КассаККМИспользоватьБезПодключенияОборудования = КассаККМ.ИспользоватьБезПодключенияОборудования;
	
	Объект.ЭквайринговыйТерминал = Параметры.ЗначенияЗаполнения.ЭквайринговыйТерминал;
	
	СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСменыНаСервере(КассаККМ);
	ЗаполнитьЗначенияСвойств(Объект, СтруктураСостояниеКассовойСмены);
	Объект.КассоваяСмена = СтруктураСостояниеКассовойСмены.ОтчетОРозничныхПродажах;
	ОстатокВКассе = СтруктураСостояниеКассовойСмены.НаличностьВКассе;
	ОстатокВКассеСтрока = "" + ОстатокВКассе;
	
	Объект.КассаККМ = КассаККМ;
	Объект.СтруктурнаяЕдиница = КассаККМ.СтруктурнаяЕдиница;
	Если КассаККМ.СтруктурнаяЕдиница.РозничныйВидЦен.Пустая() Тогда
		Объект.ВидЦен = Справочники.ВидыЦен.Оптовая; // Значение заполнения реквизита ВидЦен в документе ОтчетОРозничныхПродажах.
	Иначе
		Объект.ВидЦен = КассаККМ.СтруктурнаяЕдиница.РозничныйВидЦен;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
		Объект.ВалютаДокумента = КассаККМ.ВалютаДенежныхСредств;
	КонецЕсли;
	Объект.Организация = Объект.КассаККМ.Владелец;
	Объект.Подразделение = Объект.КассаККМ.Подразделение;
	Объект.Ответственный = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь, "ОсновнойОтветственный");
	
	ЕстьПравоОформлятьРКО = ПравоДоступа("Добавление", Метаданные.Документы.РасходИзКассы);
	// Конец РМК
	
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация);
	
	// Временно.
	Объект.НДСВключатьВСтоимость = Истина;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПолучитьСписокВыбораВидовПлатежныхКарт();
	КонецЕсли;
	
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	Если ИспользоватьПодключаемоеОборудование Тогда
		ПолучитьСсылкиНаОборудование();
	КонецЕсли;
	Элементы.ЗапасыЗагрузитьДанныеИзТСД.Видимость = ИспользоватьПодключаемоеОборудование;
	
	// +++ { AzRy - [26.05.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	//КонтрольНаСкладеОтключен = НЕ Константы.КонтролироватьОстаткиПриПроведении.Получить()
	КонтрольНаСкладеОтключен = НЕ УправлениеНебольшойФирмойСервер.ВыполнитьКонтрольОстатков()
	// +++ } AzRy - [26.05.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
						   ИЛИ НЕ Константы.КонтролироватьОстаткиПриПробитииЧековККМ.Получить();
	
	Элементы.СнятьРезервирование.Видимость = НЕ КонтрольНаСкладеОтключен;
	
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", Объект.ВалютаДокумента));
	Курс = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Курс
	);
	Кратность = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Кратность
	);
	
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", Константы.НациональнаяВалюта.Получить()));
	КурсНациональнаяВалюта = СтруктураПоВалюте.Курс;
	КратностьНациональнаяВалюта = СтруктураПоВалюте.Кратность;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка)
		И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ЗаполнитьСтавкуНДСПоОрганизациияНалогообложениеНДС();
	ИначеЕсли Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда	
		Элементы.ЗапасыСтавкаНДС.Видимость = Истина;
		Элементы.ЗапасыСуммаНДС.Видимость = Истина;
		Элементы.ЗапасыВсего.Видимость = Истина;
	Иначе
		Элементы.ЗапасыСтавкаНДС.Видимость = Ложь;
		Элементы.ЗапасыСуммаНДС.Видимость = Ложь;
		Элементы.ЗапасыВсего.Видимость = Ложь;
	КонецЕсли;
	
	УчетВалютныхОпераций = Константы.ФункциональнаяУчетВалютныхОпераций.Получить();
	СтруктураНадписи = Новый Структура("ВидЦен, ВидСкидки, ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, НалогообложениеНДС, ДисконтнаяКарта, ПроцентСкидкиПоДисконтнойКарте", Объект.ВидЦен, Объект.ВидСкидкиНаценки, Объект.ВалютаДокумента, Объект.ВалютаДокумента, Курс, КурсНациональнаяВалюта, Объект.СуммаВключаетНДС, УчетВалютныхОпераций, Объект.НалогообложениеНДС, Объект.ДисконтнаяКарта, Объект.ПроцентСкидкиПоДисконтнойКарте);
	ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
	
	КассаККМИспользоватьБезПодключенияОборудования = Объект.КассаККМ.ИспользоватьБезПодключенияОборудования;
	
	ИспользуетсяРегистрацияРозничныхПродажВЕГАИС = УправлениеНебольшойФирмойСервер.ИспользуетсяРегистрацияРозничныхПродажВЕГАИС();
	
	УстановитьДоступностьПечатиЧека();
	
	Элементы.ЗапасыСуммаСкидкиНаценки.Видимость = Константы.ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи.Получить();
	
	Если Объект.Статус = Перечисления.СтатусыЧековККМ.Пробит
	И НЕ КассаККМИспользоватьБезПодключенияОборудования Тогда
		УстановитьРежимТолькоПросмотр();
	КонецЕсли;
	
	// Установка доступности цен для редактирования.
	РазрешеноРедактированиеЦенДокументов = УправлениеНебольшойФирмойУправлениеДоступомПовтИсп.РазрешеноРедактированиеЦенДокументов();
	ПродажаСоСклада = Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад;
	
	Элементы.ЗапасыЦена.ТолькоПросмотр 					= НЕ РазрешеноРедактированиеЦенДокументов; // ИЛИ НЕ ПродажаСоСклада;
	Элементы.ЗапасыСумма.ТолькоПросмотр 				= НЕ РазрешеноРедактированиеЦенДокументов; // ИЛИ НЕ ПродажаСоСклада; 
	Элементы.ЗапасыПроцентСкидкиНаценки.ТолькоПросмотр  = НЕ РазрешеноРедактированиеЦенДокументов;
	Элементы.ЗапасыСуммаСкидкиНаценки.ТолькоПросмотр 	= НЕ РазрешеноРедактированиеЦенДокументов;
	Элементы.ЗапасыСуммаНДС.ТолькоПросмотр 				= НЕ РазрешеноРедактированиеЦенДокументов; // ИЛИ НЕ ПродажаСоСклада;
	
	// СтруктурнаяЕдиница - пустой быть не может
	ТипСтруктурнойЕдиницы = Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы;
	
	// ПодборНоменклатурыВДокументах
	ПодборНоменклатурыВДокументах.НазначитьФормуПодбора(ПараметрыОткрытияПодбора, Объект.Ссылка.Метаданные().Имя, "Запасы");
	// Конец ПодборНоменклатурыВДокументах
	
	// АвтоматическиеСкидки.
	АвтоматическиеСкидкиПриСозданииНаСервере();
	
	// РМК
	СменаОткрыта = Перечисления.СтатусыОтчетаОРозничныхПродажах.Открыта;
	
	Список.Параметры.УстановитьЗначениеПараметра("КассаККМ", КассаККМ);
	Список.Параметры.УстановитьЗначениеПараметра("БезПодключенияОборудования", КассаККМИспользоватьБезПодключенияОборудования);
	Список.Параметры.УстановитьЗначениеПараметра("Статус", СменаОткрыта);
	Список.Параметры.УстановитьЗначениеПараметра("ОтборПоСтатусам", Истина);
	Список.Параметры.УстановитьЗначениеПараметра("ОтборПоСмене", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("КассоваяСмена", Документы.ОтчетОРозничныхПродажах.ПустаяСсылка());
	
	СписокЧековККМ.Параметры.УстановитьЗначениеПараметра("КассаККМ", КассаККМ);
	СписокЧековККМ.Параметры.УстановитьЗначениеПараметра("БезПодключенияОборудования", КассаККМИспользоватьБезПодключенияОборудования);
	СписокЧековККМ.Параметры.УстановитьЗначениеПараметра("Статус", СменаОткрыта);
	СписокЧековККМ.Параметры.УстановитьЗначениеПараметра("ОтборПоСтатусам", Истина);
	СписокЧековККМ.Параметры.УстановитьЗначениеПараметра("ОтборПоСмене", Ложь);
	СписокЧековККМ.Параметры.УстановитьЗначениеПараметра("КассоваяСмена", Документы.ОтчетОРозничныхПродажах.ПустаяСсылка());
	
	СписокЧековККМНаВозврат.Параметры.УстановитьЗначениеПараметра("КассаККМ", КассаККМ);
	СписокЧековККМНаВозврат.Параметры.УстановитьЗначениеПараметра("БезПодключенияОборудования", КассаККМИспользоватьБезПодключенияОборудования);
	СписокЧековККМНаВозврат.Параметры.УстановитьЗначениеПараметра("Статус", СменаОткрыта);
	СписокЧековККМНаВозврат.Параметры.УстановитьЗначениеПараметра("ОтборПоСтатусам", Истина);
	СписокЧековККМНаВозврат.Параметры.УстановитьЗначениеПараметра("ОтборПоСмене", Ложь);
	СписокЧековККМНаВозврат.Параметры.УстановитьЗначениеПараметра("КассоваяСмена", Документы.ОтчетОРозничныхПродажах.ПустаяСсылка());
	
	// СтруктурнаяЕдиница - пустой быть не может
	ТипСтруктурнойЕдиницы = Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы;
	
	СформироватьЗаголовок(СтруктураСостояниеКассовойСмены);
	
	// Быстрые товары и настройки кнопок и команд меню.
	ЗаполнитьБыстрыеТовары(Истина);
	НастроитьКнопкиИКомандыМеню();
	
	ЦветВажныхКнопок = ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет;
	
	// Виды периодов.
	ЗаТекущуюСмену = Перечисления.ВидыПериодовРМК.ЗаТекущуюСмену;
	ЗаПроизвольныйПериод = Перечисления.ВидыПериодовРМК.ЗаПроизвольныйПериод;
	ЗаВчерашнийДень = Перечисления.ВидыПериодовРМК.ЗаВчерашнийДень;
	ЗаВесьПериод = Перечисления.ВидыПериодовРМК.ЗаВесьПериод;
	ЗаПрошлуюСмену = Перечисления.ВидыПериодовРМК.ЗаПрошлуюСмену;
	
	ЗаполнитьСпискиВидыПериодов();
	
	УстановитьПериодНаСервере(ЗаТекущуюСмену, "СписокЧековККМ");
	УстановитьПериодНаСервере(ЗаТекущуюСмену, "СписокЧековККМНаВозврат");
	УстановитьПериодНаСервере(ЗаТекущуюСмену, "Список");
	УстановитьПериодНаСервере(ЗаПроизвольныйПериод, "СписокЗаказов", Новый СтандартныйПериод);
	
	ПереключательЖурналБыстрыеТовары = 1;
	
	// Установим формат для текущей даты: ДФ=Ч:мм
	УправлениеНебольшойФирмойСервер.УстановитьОформлениеКолонкиДата(Список);
	УправлениеНебольшойФирмойСервер.УстановитьОформлениеКолонкиДата(СписокЧековККМНаВозврат);
	УправлениеНебольшойФирмойСервер.УстановитьОформлениеКолонкиДата(СписокЗаказов);
	
	СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСменыНаСервере(КассаККМ);
	ОбновитьВидимостьНадписиИстеклоБолее24Часов(СтруктураСостояниеКассовойСмены);
	
	ТипНоменклатурыЗапас = Перечисления.ТипыНоменклатуры.Запас;
	ТипНоменклатурыУслуга = Перечисления.ТипыНоменклатуры.Услуга;
	// Конец РМК
	
	// Заказы покупателей в Рознице
	НастроитьСписокЗаказовПокупателейПриСозданииНаСервере();
	// Конец Заказы покупателей в Рознице
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
		
	// Серийные номера
	ИспользоватьСерийныеНомераОстатки = РаботаССерийнымиНомерами.ИспользоватьСерийныеНомераОстатки();
	
	Элементы.ОстатокВКассе.Видимость = Константы.ДеньгиВКассеККМ_РабочееМестоКассира.Получить(); // Kuzmich, 09.03.2019, Деньги в кассе ККМ (рабочее место кассира)
	
	//+++ Lazare_18.05.2021
	Если  Константы.ФункционалКодовРазблокировки.Получить()И Не РольДоступна("ПолныеПрава")
		Тогда
		Элементы.ИзменитьКоличествоСПомощьюКалькулятора.Видимость = Ложь ;
		Элементы.Запасы.КонтекстноеМеню.ПодчиненныеЭлементы.ЗапасыКонтекстноеМенюОчиститьТЧЗапасы.Видимость = Ложь ;
	Иначе 
		Элементы.ИзменитьКоличествоСПомощьюКалькулятора.Видимость  = Истина ;
		Элементы.Запасы.КонтекстноеМеню.ПодчиненныеЭлементы.ЗапасыКонтекстноеМенюОчиститьТЧЗапасы.Видимость = Истина ;
	КонецЕсли;	
	//--- Lazare_18.05.2021
	
	//+++ Дмгг
	тзУчетнаяПолитика = РегистрыСведений.УчетнаяПолитикаРегл.СрезПоследних(,Новый Структура("Организация", Объект.Организация));
	Если тзУчетнаяПолитика.Количество() > 0 Тогда 
		ИспользоватьНовуюФормуОплат = тзУчетнаяПолитика[0].ИспользоватьНовуюФормуОплаты;
	КонецЕсли;
	//--- Дмгг
	
	//Консультанты В шапке и Тз "запасы
	//++Lazare 05.08.2021
	ВидимостьКонсультанта = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьКонсультантыВЧекККМ");	
	Элементы.Консультант.Видимость  = ВидимостьКонсультанта;
	Элементы.ЗапасыКонсультант.Видимость = ВидимостьКонсультанта;	
	//--Lazare 05.08.2021
	
	ИспользоватьРазныеПринтерыЧековДляОтделов = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоЧековДляРозичнойТорговли"); //+++ Дмгг
	
КонецПроцедуры
